/*******************************************************/
/*                                                     */
/*  lab_work_04_03                                     */
/*  Мова: C++                                          */
/*                                                     */
/*    Підпрограми-функції з параметрами-посиланнями    */
/*  засобами мови C++.                                 */
/*    Дано: R - радіус основи прямого кругового        */
/*  циліндра; h - висота прямого кругового циліндра.   */
/*    Обчислити та вивести на друк:                    */
/*  sb=2*pi*r*h - площа бічної поверхні циліндра;      */
/*  sp=sb+2*pi*r*r - площа повної поверхні циліндра;   */
/*  v=pi*r*r*h - об'єм циліндра.                       */
/*    Для обчислення величин sb, sp та v скласти       */
/*  підпрограми-функції з параметрами-посиланнями.     */
/*                                                     */
/*******************************************************/

#include <iostream>
#include <math.h>
#include <conio.h>
#include <windows.h>
using namespace std;

#define pi 3.14159f

// Прототип підпрограми-функції:
void cylindr(float rc, float hc, float &Psb, float &Psp, float &Pv);

int main() {
	// Оголошення констант та змінних:
	float r;   // радіус основи прямого кругового циліндра
	float h;   // висота прямого кругового циліндра
	float sb;  // площа бічної поверхні циліндра
	float sp;  // площа повної поверхні циліндра
	float v;   // об'єм циліндра

	clrscr();
	SetConsoleCP(1251);
	SetConsoleOutputCP(1251);

	// Ввід заданих величин радіуса та висоти:
	cout << "\n  Введіть радіус основи циліндра: ";
	cin >> r;
	cout << "\n  Введіть висоту циліндра: ";
	cin >> h;

	// Обчислення параметрів циліндра:
	cylindr(r, h, sb, sp, v);

	cout << endl << "  Площа бічної поверхні циліндра sb=" << sb << endl;
	cout << "  Площа повної поверхні циліндра sp=" << sp << endl;
	cout << "  Об'єм циліндра                  v=%" << v << endl;

	getch();

	return 0;
}

//-------------------------------------------------------
// Підпрограма-функція з параметрами-посиланнями
// для обчислення параметрів циліндра

void cylindr(float rc, float hc, float &Psb, float &Psp, float &Pv) {
	Psb = 2 * pi * rc * hc;         // Площа бічної поверхні
	Psp = Psb + 2 * pi * rc * rc;  // Площа повної поверхні
	Pv = pi * rc * rc * hc;         // Об'єм циліндра
}
