/**********************************************************/
/*                                                        */
/*  lab_work_21_02                                        */
/*  Мова: C++                                             */
/*                                                        */
/*  Робота з функцiями для обробки символiв з бiблiотеки  */
/* обробки символів <cctype>:                             */
/*  int islower(int c);                                   */
/*  int isupper(int c);                                   */
/*  int tolower(int c);                                   */
/*  int toupper(int c);                                   */
/*                                                        */
/**********************************************************/

#include <iostream>
#include <cctype>

using namespace std;

int main() {
	// int islower(int c) – функція повертає 1 (iстинне значення),
	// якщо c - буква нижнього регiстру, i 0 - в протилежному випадку
	cout << "Демонструємо роботу з функцiєю islower:" << endl;
	cout << "  " << 'p' << (islower('p') ? " є" : " не є") << " буквою нижнього регістру" << endl;
	cout << "  " << 'P' << (islower('P') ? " є" : " не є") << " буквою нижнього регістру" << endl;
	cout << "  " << '5' << (islower('5') ? " є" : " не є") << " буквою нижнього регістру" << endl;
	cout << "  " << '!' << (islower('!') ? " є" : " не є") << " буквою нижнього регістру" << endl;

	// int isupper(int c) – функція повертає 1 (iстинне значення),
	// якщо c - буква верхнього регiстру, i 0 - в протилежному //випадку
	cout << "Демонструємо роботу з функцiєю isupper:" << endl;
	cout << "  " << 'p' << (isupper('p') ? " є" : " не є") << " буквою верхнього регістру" << endl;
	cout << "  " << 'P' << (isupper('P') ? " є" : " не є") << " буквою верхнього регістру" << endl;
	cout << "  " << '5' << (isupper('5') ? " є" : " не є") << " буквою верхнього регістру" << endl;
	cout << "  " << '!' << (isupper('!') ? " є" : " не є") << " буквою верхнього регістру" << endl;

	// int tolower(int c) - якщо с - буква нижнього регiстру,
	// то функцiя повертає значення с у верхньому регiстрi,
	// в протилежному випадку значення с повертаєтся без змiн
	cout << "Демонструємо роботу з функцiєю tolower:" << endl;
	cout << "  Символ " << 'p' << " у нижньому регістрі: " << (char) tolower('p') << endl;
	cout << "  Символ " << '7' << " у нижньому регістрі: " << (char) tolower('7') << endl;
	cout << "  Символ " << '$' << " у нижньому регістрі: " << (char) tolower('$') << endl;
	cout << "  Символ " << 'L' << " у нижньому регістрі: " << (char) tolower('L') << endl;

	// int toupper(int c) - якщо с - буква нижнього регiстру,
	// то функцiя повертає значення с у верхньому регiстрi,
	// в протилежному випадку значення с повертаєтся без змiн
	cout << "Демонструємо роботу з функцiєю toupper:" << endl;
	cout << "  Символ " << '7' << " у верхньому регістрі: " << (char) toupper('7') << endl;
	cout << "  Символ " << 'p' << " у верхньому регістрі: " << (char) toupper('p') << endl;
	cout << "  Символ " << '$' << " у верхньому регістрі: " << (char) toupper('$') << endl;
	cout << "  Символ " << 'L' << " у верхньому регістрі: " << (char) toupper('L') << endl;

	return 0;
}
