/*******************************************************/
/*                                                     */
/*  lab_work_03_04                                     */
/*  Мова: C                                            */
/*                                                     */
/*    Задання точності при виведенні даних             */
/*  засобами мови C.                                   */
/*    Навести приклад зчитування одного числа і        */
/*  виведення його в різних форматах.                  */
/*                                                     */
/*******************************************************/

#include <stdio.h>

int main() {
	int i;

	printf("\n  Введіть число: ");
	scanf("%d", &i);

	printf("\n  Задане число у різних форматах:");
	printf("\n  - %s : %d",  "%d ", i);
	printf("\n  - %s : %+d", "%+d", i);
	printf("\n  - %s : %d",  "%d ", i);
	printf("\n  - %s : %o",  "%o ", i);
	printf("\n  - %s : %x",  "%x ", i);
	printf("\n  - %s : %X",  "%X ", i);

	float a = 5.0f;
	printf("%4.2f", a);
	printf("%d, %d, %d, %d", -1, 2, 3, 4);

	return 0;
}

