/*******************************************************/
/*                                                     */
/*  lab_work_03_04                                     */
/*  Мова: C                                            */
/*                                                     */
/*    Задання точності при виведенні даних             */
/*  засобами мови C.                                   */
/*    Навести приклад зчитування одного числа і        */
/*  виведення його в різних форматах.                  */
/*                                                     */
/*******************************************************/

#include <stdio.h>
#include <conio.h>
#include <windows.h>

int main() {
	int i;

	clrscr();
	SetConsoleCP(1251);
	SetConsoleOutputCP(1251);

	printf("\n  Введіть число: ");
	scanf("%d", &i);

	printf("\n  Задане число у різних форматах:");
	printf("\n  - %s : %d",  "%d ", i);
	printf("\n  - %s : %+d", "%+d", i);
	printf("\n  - %s : %d",  "%d ", i);
	printf("\n  - %s : %o",  "%o ", i);
	printf("\n  - %s : %x",  "%x ", i);
	printf("\n  - %s : %X",  "%X ", i);

	getch();

    return 0;
}

