/*******************************************************/
/*                                                     */
/*  lab_work_02_02                                     */
/*  Мова: C++                                          */
/*                                                     */
/*    Бібліотека арифметичних функцій C/C++.           */
/*    Дано: x, y, z - змінні дійсьного типу.           */
/*    Обчислити значення виразів a=f1(x, y, z) та      */
/*  b = f2(x, y, z). Вивести на друк вхідні величини і */
/*  результати обчислень, у тому числі значення        */
/*  проміжних величин, у вигляді таблиці.              */
/*                                                     */
/*******************************************************/

#include <iostream>
#include <math.h>
#include <conio.h>
#include <windows.h>

#define pi 3.14159f

using namespace std;

int main() {
    float x, y, z;
    float a1, a2, a3, a4, a5, a;
    float b1, b2, b3, b4, b5, b;

	clrscr();
    SetConsoleCP(1251);
    SetConsoleOutputCP(1251);

    // Ввід заданих величин:
    cout << "  Введіть значення трьох дійсьних змінних:\n   ";
    cin >> x >> y >> z;

    // Обчислення виразу a:
    a1 = y / (2 + y * y + fabs(y * z));
    a2 = acos(a1);
    a3 = pi + x * x + pow(sin(y * z), 2);
    a4 = pow(a3, 1 / 2);
    a5 = log10(2 / (x * x + y * y + 1));
    a = a2 * (a4 - a5);

    // Обчислення виразу b:
    b1 = exp(-3 * x * x + y / 3 - z);
    b2 = pow(tan(x), 2);
    b3 = b2 / (1 + sin(pi * y / 2));
    b4 = pow(b3, 1 / 3);
    b5 = (x + y + z) / (x * y * z);
    b = b1 + b4 - pow(b5, 2);

    // Друк результатів у вигляді таблиці:
    cout.precision(2);
    cout << endl << "  Вхідні величини та результати обчислень:";
    cout << endl << "  I-------------------------------------------I";
    cout << endl << "  I             Вхідні  величини:             I";
    cout << endl << "  I-------------------------------------------I";
    cout << endl << "  I         x=         I         " << fixed << x << "         I";
    cout << endl << "  I-------------------------------------------I";
    cout << endl << "  I         y=         I         " << fixed << y << "         I";
    cout << endl << "  I-------------------------------------------I";
    cout << endl << "  I         z=         I         " << fixed << z << "         I";
    cout << endl << "  I-------------------------------------------I";
    cout << endl << "  I             Результати обчислень:         I";
    cout << endl << "  I-------------------------------------------I";
    cout << endl << "  I   a1=   I    " << fixed << a1
        << "   I    b1=  I   " << fixed << b1 << "    I";
    cout << endl << "  I-------------------------------------------I";
    cout << endl << "  I   a2=   I    " << fixed << a2
        << "   I    b2=  I   " << fixed << b2 << "    I";
    cout << endl << "  I-------------------------------------------I";
    cout << endl << "  I   a3=   I    " << fixed << a3
        << "   I    b3=  I   " << fixed << b3 << "    I";
    cout << endl << "  I-------------------------------------------I";
    cout << endl << "  I   a4=   I    " << fixed << a4
        << "   I    b4=  I   " << fixed << b4 << "    I";
    cout << endl << "  I-------------------------------------------I";
    cout << endl << "  I   a5=   I   " << fixed << a5
        << "   I    b5=  I   " << fixed << b5 << "    I";
    cout << endl << "  I-------------------------------------------I";
    cout << endl << "  I   a =   I    " << fixed << a
        << "   I    b =  I   " << fixed << b << "    I";
    cout << endl << "  I-------------------------------------------I";

    getch();

    return 0;
}
