/**********************************************************/
/*                                                        */
/*  lab_work_16_01                                        */
/*  Мова: C++                                             */
/*                                                        */
/*  Перестановка елементiв масиву у зворотному порядку.   */
/* Дано одномiрний масив а, що мiстить n елементiв.       */
/* Переставити елементи масиву у зворотному порядку.      */
/* Доступ до елементiв масиву здiйснити за допомогою      */
/* вказiвникiв.                                           */
/*                                                        */
/**********************************************************/

#include <iostream>
#include <cmath>

using namespace std;

const int MAX_SIZE = 100;

int n;             // Кількість елементів масиву
float a[MAX_SIZE]; // Масив

// Функція для зчитування масиву
void read_array() {
	cout << "Введіть кількість елементів (n <= " << MAX_SIZE << "): ";
	cin >> n;

	for (int i = 0; i < n; ++i) {
		cout << "  Введіть a[" << i << "]: ";
		cin >> *(a + i);
	}
}

// Функція для розвертання масиву
void reverse_array() {
	for (int i = 0, j = n - 1; i < j; ++i, --j) {
		swap(*(a + i), *(a + j));
	}
}

// Функція для виводу масиву
void print_array(const char *prefix) {
	cout << prefix << ":" << endl << " ";

	for (int i = 0; i < n; ++i) {
		cout << " " << *(a + i);
	}

	cout << endl;
}

int main() {
	read_array();

	print_array("Масив до перетворення");

	reverse_array();

	print_array("Перетворений масив");

	return 0;
}
