/**********************************************************/
/*                                                        */
/*  lab_work_17_01                                        */
/*  Мова: C                                               */
/*                                                        */
/*  Смисл імені двовимірного масиву.                      */
/*                                                        */
/**********************************************************/

#include <stdio.h>

int main() {
	char a[2][3] = {'Q', 'W', 'E', 'R', 'T', 'Y'};

	// Використання iменi масиву без iндексiв:
	printf("Використання iменi масиву без iндексiв:\n");

	// Друк а
	printf("  a = %p\n",a);

	// Друк значення елемента а[0][0]
	printf("Iмя масиву a без iндексiв - це адреса елемента a[0][0]:\n");
	printf("  a[0][0] = %p\n", a);

	printf("\n");


	// Використання посилань на елементи масиву:
	printf("Використання посилань на елементи масиву:\n");

	// Друк адреси елемента а[0][0]
	printf("  &a = %p\n", &a);

	// Друк адреси елемента а[0][0]
	printf("  &a[0][0] = %p\n", &a[0][0]);

	// Друк адреси елемента а[0][1]
	printf("  &a[0][1] = %p\n", &a[0][1]);

	// Друк адреси елемента а[0][2]
	printf("  &a[0][2] = %p\n", &a[0][2]);

	// Друк адреси елемента а[1][0]
	printf("  &a[1][0] = %p\n", &a[1][0]);

	// Друк адреси елемента а[1][1]
	printf("  &a[1][1] = %p\n", &a[1][1]);

	// Друк адреси елемента а[1][2]
	printf("  &a[1][2] = %p\n", &a[1][2]);

	printf("Посилання на елемент масиву &a[i][j] - це адреса елемента a[i][j]\n");

	printf("\n");


	// Використання вказiвникiв на елементи масиву:
	printf("Використання вказiвникiв на елементи масиву:\n");

	// Друк значення елемента а[0][0]
	printf("  **a = %c\n", **a);

	// Друк значення елемента а[0][0]
	printf("  *(*(a + 0) + 0) = %c\n", *(*(a + 0) + 0));

	// Друк значення елемента а[0][1]
	printf("  *(*(a + 0) + 1) = %c\n", *(*(a + 0) + 1));

	// Друк значення елемента а[0][2]
	printf("  *(*(a + 0) + 2) = %c\n", *(*(a + 0) + 2));

	// Друк значення елемента а[1][0]
	printf("  *(*(a + 1) + 0) = %c\n", *(*(a + 1) + 0));

	// Друк значення елемента а[1][1]
	printf("  *(*(a + 1) + 1) = %c\n", *(*(a + 1) + 1));

	// Друк значення елемента а[1][2]
	printf("  *(*(a + 1) + 2) = %c\n", *(*(a + 1) + 2));

	printf("Вказiвник на елемент масиву *(*(a + i) + j) - це значення елемента a[i][j]\n");

	printf("\n");


	// Використання iндексiв елементiв масиву:
	printf("Використання iндексiв елементiв масиву:\n");
	
	// Друк значення елемента а[0][0]
	printf("  a[0][0] = %c\n", a[0][0]);
	
	// Друк значення елемента а[0][1]
	printf("  a[0][1] = %c\n", a[0][1]);
	
	// Друк значення елемента а[0][2]):
	printf("  а[0][2] = %c\n", a[0][2]);
	
	// Друк значення елемента а[1][0]
	printf("  а[1][0] = %c\n", a[1][0]);
	
	// Друк значення елемента а[1][1]
	printf("  a[1][1] = %c\n", a[1][1]);
	
	// Друк значення елемента а[1][2]
	printf("  a[1][2] = %c\n", a[1][2]);

	printf("Елемент масиву a[i][j] - це значення елемента a[i][j]\n");

	return 0;
}
