/*******************************************************/
/*                                                     */
/*  lab_work_03_03                                     */
/*  Мова: C                                            */
/*                                                     */
/*    Задання точності при виведенні даних             */
/*  засобами мови C.                                   */
/*    Навести приклади використання точності при       */
/*  виведенні даних різних типів.                      */
/*                                                     */
/*******************************************************/

#include <stdio.h>

int main() {
	int i = 873;
	double f = 123.94536;
	char s[] = "З днем народження!";

	printf("\n  Використання точності для друку даних цілого типу:");
	printf("\n  Друк цілого числа 873 форматами %%.4d та %%.9d:");
	printf("\n\t%.4d\n\t%.9d\n", i, i);

	printf("\n  Використання точності для друку даних дійсного типу:");
	printf("\n  Друк дійсного числа 123.94536 форматами");
	printf("\n  %%.3f, %%.3e та %%.3g:");
	printf("\n\t%3.f\n\t%.3e\n\t%.3g\n", f, f, f);

	printf("\n  Використання точності для друку стрічкових даних:");
	printf("\n  Друк стрічки \"З днем народження!\" форматом %%.14s:");
	printf("\n\t%.17s\n", s);

	return 0;
}
