/*******************************************************/
/*                                                     */
/*  lab_work_14_01                                     */
/*  Мова: C                                            */
/*                                                     */
/*  Обчислення факторіала за допомогою рекурсії.       */
/*    Обчислити n!, використовуючи функцію користувача */
/*  користувача для обчислення факторіала, звернення   */
/*  до якої відбувається рекурсивно.                   */
/*                                                     */
/*******************************************************/

#include <stdio.h>

double factorial(int n);

int main() {
	int n;

	// Ввід числа n
	printf("\n  Ввести число n <= 15, факторіал від якого треба обчислити: ");
	scanf("%d", &n);

	printf("\n  Факторіал числа %d дорівнює: %.0lf\n", n, factorial(n));

	return 0;
}

//-------------------------------------------------------
double factorial(int n) {
	if (n > 1) {
		return n * factorial(n - 1);
	} else {
		return 1;
	}
}
