/*******************************************************/
/*                                                     */
/*  lab_work_04_04                                     */
/*  Мова: C++                                          */
/*                                                     */
/*    Підпрограми-функції з параметрами-вказівниками   */
/*  засобами мови C++.                                 */
/*    Дано: x1 - координата x першої точки;            */
/*          y1 - координата y першої точки;            */
/*          x2 - координата x другої точки;            */
/*          y2 - координата y другої точки;            */
/*          a - параметр A прямої;                     */
/*          b - параметр B прямої;                     */
/*          c - параметр C прямої;                     */
/*    Обчислити та вивести на друк:                    */
/*  m1a - відстань від першої точки до прямої;         */
/*  m2a - відстань від другої точки до прямої;         */
/*    Для обчислення величин m1a та m2a скласти        */
/*  підпрограми-функції з параметрами-вказівниками.    */
/*                                                     */
/*******************************************************/

#include <iostream>
#include <math.h>
#include <conio.h>
#include <windows.h>
using namespace std;

// Прототипи підпрограм-функцій:
void distance(float a, float b, float c, float x, float y, float *r);

int main() {
	// Оголошення констант та змінних:
	float x1;   // координата х першої точки
	float y1;   // координата y першої точки
	float x2;   // координата х другої точки
	float y2;   // координата y другої точки
	float a;    // параметр A прямої
	float b;    // параметр B прямої
	float c;    // параметр C прямої
	float m1a;  // відстань першої точки до прямої
	float m2a;  // відстань другої точки до прямої

	clrscr();
	SetConsoleCP(1251);
	SetConsoleOutputCP(1251);

	// Reading input:
	cout << "\n  Введіть вхідні значення:";
	cout << "\n  x1 = ";
	cin >> x1;
	cout << "\n  y1 = ";
	cin >> y1;
	cout << "\n  x2 = ";
	cin >> x2;
	cout << "\n  y2 = ";
	cin >> y2;
	cout << "\n  A = ";
	cin >> a;
	cout << "\n  B = ";
	cin >> b;
	cout << "\n  C = ";
	cin >> c;

	// Обчислення значень:
	distance(a, b, c, x1, y1, &m1a);
	distance(a, b, c, x2, y2, &m2a);

	// Виведення значень:
	cout << "\n";
	cout << "  Відстань від першої точки до прямої: m1a = " << m1a << endl;
	cout << "  Відстань від другої точки до прямої: m2a = " << m2a << endl;

	getch();

	return 0;
}

//-------------------------------------------------------
// Функція для обчислення відстані від прямої до точки
void distance(float a, float b, float c, float x, float y, float *r) {
	float v1 = abs(a * x + b * y + c);
	float v2 = sqrt(a * a + b * b);
	*r = v1 / v2;
}
