/*******************************************************/
/*                                                     */
/*  lab_work_06_01                                     */
/*  Мова: C                                            */
/*                                                     */
/*    Обчислення значення складної функції засобами    */
/*  мови C.                                            */
/*    Обчислити значення складної функції y:           */
/*  y = x*x - 2*x + 1, якщо       x < -1               */
/*  y = sin(3 * x),    якщо -1 <= x <  1               */
/*  y = 1 / x,         якщо       x >  4               */
/*  не існує,          в інших випадках.               */
/*    Розгалужені процеси реалізувати командою switch. */
/*                                                     */
/*******************************************************/

#include <stdio.h>
#include <math.h>

int main() {
	float x;  // Аргумент функції
	float y;  // Значення функції
	int   v;  // Варіант обчислення функції

	// Ввід значення аргумента:
	printf("\n  Введіть значення аргумента: ");
	scanf("%f", &x);

	// Вибір варіанта:
	if (x < -1) {
		v = 1;
	} else if (x >= -1 && x <= 1) {
		v = 2;
	} else if (x > 4) {
		v = 3;
	} else {
		v = 4;
	}

	// Обчислення значення складної функції:
	switch (v) {
	case 1:
		y = x*x - 2*x + 1;
		printf("  x=%4.2f    y=%4.2f\n", x, y);
		break;
	case 2:
		y = sin(3 * x);
		printf("  x=%4.2f    y=%4.2f\n", x, y);
		break;
	case 3:
		y = 1 / x;
		printf("  x=%4.2f    y=%4.2f\n", x, y);
		break;
	case 4:
		printf("  x=%4.2f    функція не існує.\n", x);
		break;
	}

	return 0;
}
