/*******************************************************/
/*                                                     */
/*  lab_work_07_02                                     */
/*  Мова: C++                                          */
/*                                                     */
/*    Табулювання функції на інтервалі засобами мови   */
/*  C++. Обчислити всі значення функції                */
/*  y = 2*sin(3*x) + 3*cos(5*x), аргумент x якої       */
/*  змінюється на інтервалі [2;4] з кроком h=0.2 .     */
/*  Обчислити також суму, кількість та середнє         */
/*  арифметичне тих значень функції, які задовільняють */
/*  нерівність 1 <= y <= 3. Якщо таких значень не      */
/*  виявиться, вивести відповідне повідомлення.        */
/*    Циклічні процеси реалізувати командою for.       */
/*                                                     */
/*******************************************************/

#include <iostream>
#include <iomanip>
#include <math.h>
using namespace std;

int main() {
	float x;      // Аргумент функції
	float y;      // Значення функції
	float s = 0;  // Сума значень функції з інтервалу [1;3]
	float sa;     // Середнє ариметичне значень функції з інтервалу [1;3]
	int k = 0;    // Кількість значень функції з інтервалу [1;3]

	cout.precision(2);

	// Табулювання функції на заданому інтервалі
	// з одночасним обчисленням кількісті k та суми s:
	cout << "\n  Результати табулювання функції:\n";

	for (x = 2.0f; x < 4.1f; x += 0.2f) {
		y = 2*sin(3*x) + 3*cos(5*x);
		cout << fixed << showpos;
		cout << "  x=" << setw(4) << x;
		cout << " y=" << setw(4) << y << "\n";
		if (y >= 1.0f && y <= 3.0f) {
			++k;
			s += y;
		}
	}

	cout << "\n  Обробка результатів табулювання функції:\n";
	if (k > 0) {
		sa = s / k;
		cout << noshowpos << setw(3);
		cout << "\n  Кількість значень функції з інтервалу [1;3] k=" << setw(3) << k;
		cout << "\n  Сума значень функції з інтервалу [1;3] s=" << setw(6) << s;
		cout << "\n  Середнє арифметичне значень функції з інтервалу [1;3] sa=" << setw(6) << sa;
	} else {
		cout << "\n  Значень функції на інтервалі [1;3] немає\n";
	}

	return 0;
}
