/*******************************************************/
/*                                                     */
/*  lab_work_04_01                                     */
/*  Мова: C                                            */
/*                                                     */
/*    Підпрограми-функції з параметрами-значеннями     */
/*  засобами мови C.                                   */
/*    Дано: R - радіус основи прямого кругового        */
/*  циліндра; h - висота прямого кругового циліндра.   */
/*    Обчислити та вивести на друк:                    */
/*  sb=2*pi*r*h - площа бічної поверхні циліндра;      */
/*  sp=sb+2*pi*r*r - площа повної поверхні циліндра;   */
/*  v=pi*r*r*h - об'єм циліндра.                       */
/*    Для обчислення величин sb, sp та v скласти       */
/*  підпрограми-функції з параметрами-значеннями.      */
/*                                                     */
/*******************************************************/

#include <stdio.h>

#define pi 3.14159f

// Прототипи підпрограм-функцій:
float BitshPoverchnja(float rc, float hc);
float PovPoverchnja(float rc, float hc);
float Objem(float rc, float hc);

int main() {
	// Оголошення констант та змінних:
	float r;   // радіус основи прямого кругового циліндра
	float h;   // висота прямого кругового циліндра
	float sb;  // площа бічної поверхні циліндра
	float sp;  // площа повної поверхні циліндра
	float v;   // об'єм циліндра

	// Ввід заданих величин радіуса та висоти:
	printf("\n  Введіть радіус основи циліндра: ");
	scanf("%f", &r);
	printf("\n  Введіть висоту циліндра: ");
	scanf("%f", &h);

	// Обчислення параметрів циліндра:
	printf("\n  Площа бічної поверхні циліндра sb=%f\n",
		BitshPoverchnja(r, h));
	printf("  Площа повної поверхні циліндра sp=%f\n",
		PovPoverchnja(r, h));
	printf("  Об'єм циліндра                  v=%f\n",
		Objem(r, h));

	return 0;
}

//-------------------------------------------------------
// Підпрограма-функція обчислення площі бічної поверхні
float BitshPoverchnja(float rc, float hc) {
	return 2 * pi * rc * hc;
}

//-------------------------------------------------------
// Підпрограма-функція обчислення площі повної поверхні
float PovPoverchnja(float rc, float hc) {
	return BitshPoverchnja(rc, hc) + 2 * pi * rc * rc;
}

//-------------------------------------------------------
// Підпрограма-функція обчислення об'єму циліндра
float Objem(float rc, float hc) {
	return pi * rc * rc * hc;
}
