/************************************************************/
/* lab_work_01_04                                           */
/*                                                          */
/*     Форматований вивід даних дійсьних типів засобами     */
/* мови С.                                                  */
/*     Навести приклади форматованого друку даних           */
/* дійсьних типів.                                          */
/*                                                          */
/************************************************************/

#include <stdio.h>
#include <conio.h>

#include <windows.h>

int main() {
	SetConsoleCP(1251);
    SetConsoleOutputCP(1251);

    printf("  Друк дійсьного числа 1234567.89 форматом %%e :\n");
    printf("  %e\n", 1234567.89);

    printf("  Друк дійсьного числа +1234567.89 форматом %%e :\n");
    printf("  %e\n", +1234567.89);

    printf("  Друк дійсьного числа -1234567.89 форматом %%e :\n");
    printf("  %e\n", -1234567.89);

    printf("  Друк дійсьного числа -1234567.89 форматом %%e :\n");
    printf("  %e\n", -1234567.89);

    printf("  Друк дійсьного числа 1234567.89 форматом %%E :\n");
    printf("  %E\n", 1234567.89);

    printf("  Друк дійсьного числа 1234567.89 форматом %%f :\n");
    printf("  %f\n", 1234567.89);

    printf("  Друк дійсьного числа 1234567.89 форматом %%g :\n");
    printf("  %g\n", 1234567.89);

    printf("  Друк дійсьного числа 1234567.89 форматом %%G :\n");
    printf("  %G\n", 1234567.89);

    getch();

    return 0;
}
