/*******************************************************/
/*                                                     */
/*  lab_work_14_02                                     */
/*  Мова: C++                                          */
/*                                                     */
/*  Обчислення суми цілих чисел на заданому інтервалі. */
/*    Обчислити суму цілих чисел, які попадають в      */
/*  заданий інтервал [a, b], використовуючи функцію    */
/*  користувача для обчислення цієї суми, звернення    */
/*  до якої відбувається рекурсивно.                   */
/*                                                     */
/*******************************************************/

#include <iostream>
using namespace std;

int sum_of_integer(int a, int b);

int main() {
	int a; // Ліва межа інтервалу
	int b; // Права межа інтервалу

	cout << "\n  Введіть ліву межу інтервалу:\n ";
	cin >> a;
	cout << "\n  Введіть праву межу інтервалу:\n ";
	cin >> b;

	cout << "\n  Сума цілих чисел на інтервалі [" << a << ", " << b << "]: " << sum_of_integer(a, b) << endl;

	return 0;
}

//-------------------------------------------------------
int sum_of_integer(int a, int b) {
	if (a == b) {
		return a;
	} else {
		return b + sum_of_integer(a, b - 1);
	}
}
