/************************************************************/
/* lab_work_01_03                                           */
/*                                                          */
/*     Форматований вивід даних цілих типів засобами        */
/* мови С.                                                  */
/*     Навести приклади форматованого друку даних           */
/* цілих типів.                                             */
/*                                                          */
/************************************************************/

#include <stdio.h>

int main() {
	printf("  Друк десяткового числа 455 форматом %%d :\n");
	printf("  %d\n", 455);

	printf("  Друк десяткового числа 455 форматом %%i :\n");
	printf("  %i\n", 455);

	printf("  Друк десяткового числа +455 форматом %%d :\n");
	printf("  %d\n", +455);

	printf("  Друк десяткового числа -455 форматом %%d :\n");
	printf("  %d\n", -455);

	printf("  Друк десяткового числа 32000 форматом %%hd :\n");
	printf("  %hd\n", 32000);

	printf("  Друк числа 2000000000 форматом %%ld :\n");
	printf("  %ld\n", 2000000000);

	printf("  Друк вісімкового числа 455 форматом %%o :\n");
	printf("  %o\n", 455);

	printf("  Друк числа -455 форматом %%u :\n");
	printf("  %u\n", -455);

	printf("  Друк шістнадцяткового числа 455 форматом %%x :\n");
	printf("  %x\n", 455);

	printf("  Друк шістнадцяткового числа 455 форматом %%X :\n");
	printf("  %X\n", 455);

	return 0;
}

