/*******************************************************/
/*                                                     */
/*  lab_work_05_01                                     */
/*  Мова: C                                            */
/*                                                     */
/*    Обчислення значення складної функції засобами    */
/*  мови C.                                            */
/*    Обчислити значення складної функції y:           */
/*  y = x*x - 2*x + 1, якщо       x < -3               */
/*  y = sin(3 * x),    якщо -1 <= x <  2               */
/*  y = 1 / x,         якщо       x >  2               */
/*  не існує,          в інших випадках.               */
/*    Розгалужені процеси реалізувати командою if.     */
/*                                                     */
/*******************************************************/

#include <stdio.h>
#include <math.h>

#define pi 3.14159f

int main() {
	float x;  // Аргумент функції
	float y;  // Значення функції

	// Ввід значення аргумента:
	printf("\n  Введіть значення аргумента: ");
	scanf("%f", &x);

	// Обчислення значення складної функції:
	if (x < -3) { // Перша гілка:
		y = x*x - 2*x + 1;
		printf("  x=%4.2f    y=%4.2f\n", x, y);
	} else if (x >= -1 && x < 2) { // Друга гілка:
		y = sin(3 * x);
		printf("  x=%4.2f    y=%4.2f\n", x, y);
	} else if (x > 4) { // Третя гілка:
		y = 1 / x;
		printf("  x=%4.2f    y=%4.2f\n", x, y);
	} else {
		printf("  x=%4.2f    функція не існує.\n", x);
	}

	return 0;
}
