/*******************************************************/
/*                                                     */
/*  lab_work_06_03                                     */
/*  Мова: C                                            */
/*                                                     */
/*    Визначити чи знаходиться точка в області,        */
/*  обмеженій функціями використовуючи мову C.         */
/*    Функції:                                         */
/*  * x = 0                                            */
/*  * y = 0                                            */
/*  * (x*x/25) + (y*y/16) = 1                          */
/*  * 4*x - 9*y - 36 = 0                               */
/*    Розгалужені процеси реалізувати командами        */
/*  if та switch.                                      */
/*                                                     */
/*******************************************************/

#include <stdio.h>
#include <conio.h>
#include <math.h>
#include <windows.h>

int main() {
	float x;  // Аргумент функції
	float y;  // Значення функції
	int   v;  // Варіант обчислення функції

	clrscr();
	SetConsoleCP(1251);
	SetConsoleOutputCP(1251);

	// Ввід значення аргумента:
	printf("\n  Введіть змінну x: ");
	scanf("%f", &x);

	printf("\n  Введіть змінну y: ");
	scanf("%f", &y);

	printf("\n  x=%4.2f    y=%4.2f\n", x, y);

	// Визначення чи знаходиться точка в межах заштрихованої області:
	if (
		x >= 0 &&
		y <= 0 &&
		y >= -sqrt(16 - 16 * x * x / 25) &&
		x <= sqrt(25 - 25 * y * y / 16) &&
		y >= (4*x - 36) / 9
	) {
		v = 1;
	} else {
		v = 2;
	}

	// Обчислення значення складної функції:
	switch (v) {
	case 1:
		printf("  Точка знаходиться в заштрихованій області.\n");
		break;
	case 2:
		printf("  Точка не знаходиться в заштрихованій області.\n");
		break;
	}

	getch();

	return 0;
}
