/*******************************************************/
/*                                                     */
/*  lab_work_14_04                                     */
/*  Мова: C++                                          */
/*                                                     */
/*    Обчислити кількість способів дійти від першої до */
/*  n-ї сходинки, якщо можна робити хід на 1, 2 або 3  */
/*  сходинки вперед.                                   */
/*                                                     */
/*******************************************************/

#include <iostream>
using namespace std;

int solve(int n);

int main() {
	int n;

	cout << "Введіть кількість сходинок: ";
	cin >> n;

	cout << "Кількість способів: " << solve(n) << endl;

	return 0;
}

//-------------------------------------------------------
int solve(int n) {
	if (n <= 0) {
		return 0;
	}

	if (n == 1) {
		return 1;
	}

	return solve(n - 3) + solve(n - 2) + solve(n - 1);
}
