/*******************************************************/
/*                                                     */
/*  lab_work_05_04                                     */
/*  Мова: C++                                          */
/*                                                     */
/*    Обчислення значення складної функції засобами    */
/*  мови C++.                                          */
/*    Обчислити значення складної функції y:           */
/*  y = pow((x*x + a*b*a*b + 1)                        */
/*    / (abs(a*x) + 1), 1.0f/5), якщо      a*x <  0    */
/*  y = pow(log(a*x + 1), 2),    якщо 0 <= a*x <  4    */
/*  y = pow(cos(a + pow(x*x, 1.0f/3)), 2),             */
/*                               якщо      a*x >= 4    */
/*    Розгалужені процеси реалізувати командою if.     */
/*                                                     */
/*******************************************************/

#include <iostream>
#include <math.h>
using namespace std;

int main() {
	float a;  // Параметр a
	float b;  // Параметр b
	float x;  // Аргумент функції
	float y;  // Значення функції

	// Ввід значення аргумента:
	cout << "\n  Введіть значення параметра a: ";
	cin >> a;
	cout << "\n  Введіть значення параметра b: ";
	cin >> b;
	cout << "\n  Введіть значення аргумента: ";
	cin >> x;

	cout.precision(2);

	// Обчислення значення складної функції:
	if (a*x < 0) { // Перша гілка:
		y = pow((x*x + a*b*a*b + 1) / (abs(a*x) + 1), 1.0f/5);
	} else if (0 <= a*x && a*x < 4) { // Друга гілка:
		y = pow(log(a*x + 1), 2);
	} else if (a*x >= 4) { // Третя гілка:
		y = pow(cos(a + pow(x*x, 1.0f/3)), 2);
	} else {
		cout << "  x=" << fixed << x << "    функція не існує.\n";
		return 0;
	}

	cout << "  x=" << fixed << x << "    y=" << fixed << y << "\n";

	return 0;
}
