/*******************************************************/
/*                                                     */
/*  lab_work_04_02                                     */
/*  Мова: C                                            */
/*                                                     */
/*    Підпрограми-функції з параметрами-вказівниками   */
/*  засобами мови C.                                   */
/*    Дано: R - радіус основи прямого кругового        */
/*  циліндра; h - висота прямого кругового циліндра.   */
/*    Обчислити та вивести на друк:                    */
/*  sb=2*pi*r*h - площа бічної поверхні циліндра;      */
/*  sp=sb+2*pi*r*r - площа повної поверхні циліндра;   */
/*  v=pi*r*r*h - об'єм циліндра.                       */
/*    Для обчислення величин sb, sp та v скласти       */
/*  підпрограми-функції з параметрами-вказівниками.    */
/*                                                     */
/*******************************************************/

#include <stdio.h>
#include <math.h>

#define pi 3.14159f

// Прототип підпрограми-функції:
void cylindr(float rc, float hc, float *Psb, float *Psp, float *Pv);

int main() {
	// Оголошення констант та змінних:
	float r;   // радіус основи прямого кругового циліндра
	float h;   // висота прямого кругового циліндра
	float sb;  // площа бічної поверхні циліндра
	float sp;  // площа повної поверхні циліндра
	float v;   // об'єм циліндра

	// Ввід заданих величин радіуса та висоти:
	printf("\n  Введіть радіус основи циліндра: ");
	scanf("%f", &r);
	printf("\n  Введіть висоту циліндра: ");
	scanf("%f", &h);

	// Обчислення параметрів циліндра:
	cylindr(r, h, &sb, &sp, &v);

	// Вивід результатів:
	printf("\n  Площа бічної поверхні циліндра sb=%f\n", sb);
	printf("  Площа повної поверхні циліндра sp=%f\n", sp);
	printf("  Об'єм циліндра                  v=%f\n", v);

	return 0;
}

//-------------------------------------------------------
// Підпрограма-функція з параметрами-вказівниками
// для обчислення параметрів циліндра
void cylindr(float rc, float hc, float *Psb, float *Psp, float *Pv) {
	*Psb = 2 * pi * rc * hc;         // Площа бічної поверхні
	*Psp = *Psb + 2 * pi * rc * rc;  // Площа повної поверхні
	*Pv = pi * rc * rc * hc;         // Об'єм циліндра
}
