/************************************************************/
/* lab_work_01_05                                           */
/*                                                          */
/*     Форматований вивід даних символьного та              */
/* стрічкового типів засобами мови С.                       */
/*     Навести приклади форматованого друку даних           */
/* символьного та стрічкового типів.                        */
/*                                                          */
/************************************************************/

#include <stdio.h>

int main() {
	char symv = 'A';
	char str[] = "Це стрічка";
	const char *strPtr = "Це також стрічка";

	printf("  Друк символа 'A' форматом %%c:\n");
	printf("  %c\n", symv);

	printf("  Друк стрічки-константи за форматом %%s:\n");
	printf("  %s\n", "Це стрічка");

	printf("  Друк стрічки з ім'ям str за форматом %%s:\n");
	printf("  %s\n", str);

	printf("  Друк стрічки з допомогою вказівника strPtr за форматом %%s:\n");
	printf("  %s\n", strPtr);

	return 0;
}
