/************************************************************/
/* lab_work_01_05                                           */
/*                                                          */
/*     Форматований вивід даних символьного та              */
/* стрічкового типів засобами мови С.                       */
/*     Навести приклади форматованого друку даних           */
/* символьного та стрічкового типів.                        */
/*                                                          */
/************************************************************/

#include <stdio.h>
#include <conio.h>

#include <windows.h>

int main() {
    char symv = 'A';
    char str[] = "Це стрічка";
    const char *strPtr = "Це також стрічка";

	SetConsoleCP(1251);
    SetConsoleOutputCP(1251);

    printf("  Друк символа 'A' форматом %%c:\n");
    printf("  %c\n", symv);

    printf("  Друк стрічки-константи за форматом %%s:\n");
    printf("  %s\n", "Це стрічка");

    printf("  Друк стрічки з ім'ям str за форматом %%s:\n");
    printf("  %s\n", str);

    printf("  Друк стрічки з допомогою вказівника strPtr за форматом %%s:\n");
    printf("  %s\n", strPtr);

    getch();

    return 0;
}
