/**********************************************************/
/*                                                        */
/*  cr_2                                                  */
/*  Мова: C++                                             */
/*                                                        */
/*  Створити масив a, кожен елемент якого обчислюється за */
/* формулою: a[i] = i!                                    */
/*                                                        */
/**********************************************************/

#include <iostream>
#include <iomanip>
#include <cmath>

using namespace std;

const int MAX_SIZE = 100;

int n;               // Кількість елементів масиву
int a[MAX_SIZE + 1]; // Вхідний результатів

void read_data(); // Функція для зчитування вхідних даних

void compute(); // Функція для формування масиву

void write_results(); // Функція для виводу результатів

int main() {
	read_data();

	compute();

	write_results();

	return 0;
}

// Функція для зчитування вхідних даних
void read_data() {
	cout << "Введіть кількість елементів масиву a (n <= " << MAX_SIZE << "): ";
	cin >> n;
}

// Функція для формування масиву
void compute() {
	a[0] = 1;

	for (int i = 1; i <= n; ++i) {
		*(a + i) = *(a + i - 1) * i;
	}
}

// Функція для виводу результатів
void write_results() {
	cout << "Вихідний масив:" << endl;

	for (int i = 1; i <= n; ++i) {
		cout << "  a[" << i << "] = " << *(a + i) << endl;
	}
}
